# DividedSurfaceCurveChainIsTooClosedToGridlines Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedSurfaceFailures..::..DividedSurfaceCurveChainIsTooClosedToGridlines Property
BuiltInFailures..::..DividedSurfaceFailures Class See Also
---
A chain formed by these curve elements defines a splitter which lies too close to gridlines and will be ignored
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedSurfaceCurveChainIsTooClosedToGridlines { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceCurveChainIsTooClosedToGridlines As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainIsTooClosedToGridlines {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace